app/Client.php

select * from `e_p_l_s` where `client_id` = 377 and `e_p_l_s`.`deleted_at` is null limit 1
---
    public function getCodeEplAttribute()
    {
        $epl = EPL::where('client_id', $this->id)->first();

select * from `site_clearence_sessions` where `client_id` = 377 and `site_clearence_sessions`.`deleted_at` is null limit 1
---
    public function getCodeSiteAttribute()
    {
        $site = SiteClearenceSession::where('client_id', $this->id)->first();