app/Http/Controllers/ComplainController.php


            $save_complain->attachment = json_encode($Arr);
        }
        $save_complain->save();
---
update `complains` set `attachment` = '[{\"img_path\":\"complain_attachments\/14\/4t2MnHQX6TY24QZKIwuIIVkg5Vmyh0qcW7ZG7dI7.jpg\",\"upload_time\":\"2022-02-24 16:21:27\",\"uploaded_user\":44}]', `complains`.`updated_at` = '2022-02-24 16:21:27' where `id` = 14

    public function update_complain(Request $request, $id)
    {
        $user = Auth::user()->id;
        request()->validate([
            "complainer_name_ipt" => 'required|max:255|string',
            "complainer_address_ipt" => 'required|max:255|string',
            "contact_complainer_ipt" => ['required', 'numeric', 'nullable', 'min:10'],
            "recieve_type_ipt" => 'required',
            "complain_desc_ipt" => 'required|max:255|string',
            "complainer_code" => 'required|max:255|string',
            // "file_list" => 'required',
            "pradeshiya_saba_id" => 'required'
        ]);

        $update_complain = Complain::find($id);
---
select * from `complains` where `complains`.`id` = '14' limit 1


            $update_complain->attachment = json_encode($Arr);
        }
        $update_complain->save();
---
update `complains` set `attachment` = '[{\"img_path\":\"complain_attachments\/14\/RAx9AuxM20XNybSi2s1KzfeZtDS4lEEj3qQV3hQ7.png\",\"upload_time\":\"2022-02-24 16:24:57\",\"uploaded_user\":44}]', `complains`.`updated_at` = '2022-02-24 16:24:57' where `id` = 14

    public function show()
    {
        $complains = Complain::with(['createdUser', 'assignedUser'])->get();
---
select * from `complains`
select * from `users` where `users`.`id` in (44) and `users`.`deleted_at` is null

    public function complainProfileData($id)
    {
        $complain_data = Complain::with(['assignedUser', 'createdUser', 'complainComments', 'complainMinutes'])->find($id);
---
select * from `complain_comments` where `complain_comments`.`complain_id` in (14)
select * from `complain_minutes` where `complain_minutes`.`complain_id` in (14)
select * from `complains` where `complains`.`id` = '14' limit 1
select * from `users` where `users`.`id` in (44) and `users`.`deleted_at` is null

    public function delete_complain($id)
    {
        $delete_complain = Complain::find($id)->delete();
---
delete from `complains` where `id` = 10
select * from `complains` where `complains`.`id` = '10' limit 1

    public function forward_to_letter_preforation($complain_id)
    {
        $confirm_complain = Complain::find($complain_id);
        $confirm_complain->status = 4;
        $confirm_complain->save();
---
select * from `complains` where `complains`.`id` = '1' limit 1
update `complains` set `status` = 4, `complains`.`updated_at` = '2022-02-24 16:20:27' where `id` = 1

    public function get_complain_assign_log($complain_id)
    {
        $complain_assign_log = ComplainAssignLog::where('complain_id', $complain_id)
            ->with(['assignerUser', 'assigneeUser'])
            ->get();
---
select * from `complain_assign_logs` where `complain_id` = '1'
select * from `users` where `users`.`id` in (44) and `users`.`deleted_at` is null