app/Http/Controllers/PradesheeyasabaController.php

select * from `pradesheeyasabas`
---
    public function show()
    {
        // $user = Auth::user();
        return Pradesheeyasaba::get();