app/Http/Controllers/ReportController.php

    public function fileProgressReport(Request $request)
    {
        $file_type_status = [
            0 => 'pending',
            1 => 'New EPL',
            2 => 'EPL Renew',
            3 => 'Site Clearance',
            4 => 'Extend Site Clearance',
        ];
        $file_status = [
            0 => 'EO pending',
            1 => 'AD File Approval Pending',
            2 => 'Certificate Preparation',
            3 => 'AD Certificate Prenidng Approval',
            4 => 'D Certificate Approval Prenidng',
            5 => 'Complete',
            6 => 'Issued',
            7 => 'Not Assigned',
            '-1' => 'Rejected',
            '-2' => 'Hold'
        ];
        $clients = Client::select('id', 'first_name', 'last_name', 'updated_at', 'deleted_at', 'industry_name', 'file_no', 'file_status', 'cer_type_status', 'cer_status', 'industry_category_id', 'environment_officer_id', 'created_at')->with('industryCategory')
            ->with('epls', 'siteClearenceSessions.siteClearances')
            ->where('file_status', '<>', 5)
            ->where('file_status', '<>', 6)
            ->orderBy('updated_at', 'ASC')
            ->get();
---
select * from `industry_categories` where `industry_categories`.`id` in (20, 21, 58, 61, 74)