app/Http/Controllers/WebDocumentController.php

select * from `letters` where `letters`.`deleted_at` is null
---
    public function get_all_letters()
    {
        $all_letters = Letter::all();

select * from `letters` where `letters`.`id` = '7' and `letters`.`deleted_at` is null limit 1
---
    public function get_letter($id)
    {
        $letter = Letter::find($id);

select * from `letters` where `letters`.`id` = '3' and `letters`.`deleted_at` is null limit 1
---
    public function update_letter_content(Request $request)
    {

        $validated = $request->validate([
            'letter_id' => 'required',
            'content' => 'required',
        ]);
        $first_name = Auth::user()->first_name;
        $last_name = Auth::user()->last_name;
        $user_name = $first_name . ' ' . $last_name;
        if ($validated) {
            $update_letter_content = Letter::find($request->letter_id);

update `letters` set `status` = '1', `letters`.`updated_at` = '2022-02-24 15:40:15' where `id` = 3
---
    public function letter_status_change($status, $id)
    {
        $status_change = Letter::find($id);
        $status_change->status = $status;
        $status_change->save();